
local 人物名称 = 获取人物信息(12)
local 当前所在地图 = 获取人物信息(16)

-- 屏幕提示(人物名称)
-- 屏幕提示(当前所在地图)



function 回自己庄园()
   if 当前所在地图 == "大理" then
      跨图寻路("大理",211,194)
      延时(2000)
      对话NPC("金五爷")
   elseif 当前所在地图 == "洛阳" then
      跨图寻路("洛阳",194,287)
      延时(2000)
      对话NPC("李萱萱")
   elseif 当前所在地图 == "楼兰" then
      跨图寻路("楼兰",207,129)
      延时(2000)
      对话NPC("李涟漪")
   else
      跨图寻路("苏州",200,284)
      延时(2000)
      对话NPC("李紫熏")
   end
   
   
   延时(500)
   NPC二级对话("单人进入庄园")
   延时(2000)


   if 人物名称 == "′星．" then
      屏幕提示("进入配偶的庄园")
      NPC二级对话("进入配偶的庄园")
   elseif 人物名称 == "′露．" then
      屏幕提示("进入配偶的庄园")
      NPC二级对话("进入配偶的庄园")
   else
      屏幕提示("进入我的庄园")
      NPC二级对话("进入我的庄园")
   end

   延时(15000)

   右键使用物品("庄园福运宝箱（5级）",1)
   右键使用物品("庄园福运宝箱（4级）",1)
   右键使用物品("庄园福运宝箱（3级）",1)
   右键使用物品("庄园福运宝箱（2级）",1)
   右键使用物品("庄园福运宝箱（1级）",1)

end




回自己庄园()