



清理物品列表="麻制囊|表情包：蛋蛋|花木笔海"
ZhuangBei="朝颜皮甲|朝颜皮靴"

-------------------------------------------------------------------------------------------------

function 晴天出售物品(AAA)  
     if 获取背包物品数量(AAA)<=0 then
		return
	end
	跨图寻路("大理",219,124)
	     计次循环 i=1,5 执行
          如果 对话NPC("蒲良")==1 则
               NPC二级对话("看看你卖的东西")
               延时 (1000)
               如果 窗口是否出现("Shop")==1 则
                    右键使用物品(AAA,1);延时(2000)  
                    跳出循环
               结束    
          结束
     结束
end

function 领取财富卡(AAA)    
	if tonumber(获取人物信息(26))<AAA then
		屏幕提示("晴天qq103900393等级不够"..AAA.."级跳过任务")
		return
	end
	 跨图寻路("大理",153,170)
     计次循环 i=1,5 执行
         如果 对话NPC("都大爽")==1 则
              NPC二级对话("领取财富卡奖励",0)     
              延时 (2000)
              NPC二级对话("至尊武圣卡")        
              延时 (3000)
				local str = string.format("%s",AAA)
			  屏幕提示(str)
			  NPC二级对话(str,1)  
			  延时 (2000)
             break
         否则 
              延时(1000)
         结束
     结束  
执行功能("出售物品")	
执行功能("自动存仓")	
	 
end

领取财富卡(40)
领取财富卡(50) 
领取财富卡(60)    
领取财富卡(70)    
领取财富卡(80)    
领取财富卡(90)    
领取财富卡(100)    
领取财富卡(105)  
领取财富卡(110)  