开启兑换礼物 = 1   --1为兑换礼物 ，0为不兑换。只修改数字
良品礼物兑换 = "佛跳墙"

--按格式修改
精品礼物兑换 = "竹蜻蜓"   --按格式修改

--珍品兑换为对应属性升级
--神品为朱砂印泥
--这两个应该不太用修改 ，真有需要  再给我说 我加上

--开启兑换礼物 = 1   --1为兑换礼物 ，0为不兑换
--良品礼物兑换 = "佛跳墙"
--精品礼物兑换 = "竹蜻蜓"

--珍品为对应属性升级   神品为朱砂印泥
--这两个应该不太用修改 ，真有需要  再给我说 我加上
local 冰属性换礼列表 = "良品礼物兑换券|" .. 良品礼物兑换 .. "|10000*精品礼物兑换券|" .. 精品礼物兑换 .. "|10000*珍品礼物兑换券|上等马驹|10000*神品礼物兑换券|朱砂印泥|10000"
local 火属性换礼列表 = "良品礼物兑换券|" .. 良品礼物兑换 .. "|10000*精品礼物兑换券|" .. 精品礼物兑换 .. "|10000*珍品礼物兑换券|十样花罗|10000*神品礼物兑换券|朱砂印泥|10000"
local 玄属性换礼列表 = "良品礼物兑换券|" .. 良品礼物兑换 .. "|10000*精品礼物兑换券|" .. 精品礼物兑换 .. "|10000*珍品礼物兑换券|山水图|10000*神品礼物兑换券|朱砂印泥|10000"
local 毒属性换礼列表 = "良品礼物兑换券|" .. 良品礼物兑换 .. "|10000*精品礼物兑换券|" .. 精品礼物兑换 .. "|10000*珍品礼物兑换券|冰素针|10000*神品礼物兑换券|朱砂印泥|10000"

function hqpz(AAA, BBB)
    local 名字 = 获取人物信息(12)
    local 路径 = string.format("C:\\天龙小蜜\\角色配置\\%s.ini", 名字)
    延时(100)
    shuju = 读配置项(路径, AAA, BBB)
    延时(100)
    return shuju
end

function xrpz(AAA, BBB, CCC)
    local 名字 = 获取人物信息(12)
    local 路径 = string.format("C:\\天龙小蜜\\角色配置\\%s.ini", 名字)
    延时(100)
    shuju = hqpz(AAA, BBB)
    if shuju ~= nil then
        if string.find(shuju, CCC) == nil then
            写配置项(路径, AAA, BBB, CCC)
            延时(100)
        end
    else
        写配置项(路径, AAA, BBB, CCC)
    end
end

function xrzsxx()
    local tem = LUA_取返回值(string.format([[
		local iIceAttack  		= Player:GetData( "ATTACKCOLD" );
		local iFireAttack 		= Player:GetData( "ATTACKFIRE" );
		local iThunderAttack	= Player:GetData( "ATTACKLIGHT" );
		local iPoisonAttack		= Player:GetData( "ATTACKPOISON" );
	local tt={ iIceAttack, iFireAttack, iThunderAttack,iPoisonAttack}
	if iIceAttack==math.max(unpack(tt)) then
	   maxOfT ="冰"
	elseif  iFireAttack==math.max(unpack(tt)) then
	maxOfT ="火"
	elseif  iThunderAttack==math.max(unpack(tt)) then
	maxOfT ="玄"
	elseif  iPoisonAttack==math.max(unpack(tt)) then
	maxOfT ="毒"
	end

	return maxOfT
	]]), "s")

    屏幕提示("属性攻击:" .. tem)
    主属性 = tem
    if tem == "冰" then
        return "上等马驹|苏州|朝覆雨|三尺冰冻*竹蜻蜓|苏州|朝覆雨|三尺冰冻*宝斋刻刀|大理|原微之|四面楚歌*大红袍|大理|原微之|四面楚歌*上等马驹|洛阳|霜见|易水萧萧*妙法佛尘|洛阳|霜见|易水萧萧*十样花罗|苏州|云中鹤|烈火灼心*山水图|苏州|慕容信|铁锁横江*冰素针|苏州|段延庆|妇人之毒*猴儿酿|苏州|谭公|魏武持刀*金丝冠|苏州|谭公|魏武持刀*猴儿酿|苏州|谭婆|三刀一梦*佛跳墙|苏州|谭婆|三刀一梦*金丝冠|苏州|赵钱孙|龟鹤延年*猴儿酿|苏州|赵钱孙|龟鹤延年*金丝冠|大理|黎夫人|兵甲护塞*猴儿酿|大理|黎夫人|兵甲护塞*猴儿酿|大理|桑土公|飞燕轻姿*金丝冠|大理|桑土公|飞燕轻姿*猴儿酿|大理|卓不凡|周王一怒*金丝冠|大理|卓不凡|周王一怒*猴儿酿|大理|芙蓉仙子|投壶问月*金丝冠|大理|芙蓉仙子|投壶问月*宝斋刻刀|大理|包不同|龟寿千年*佛跳墙|大理|包不同|龟寿千年*佛跳墙|大理|阿紫|青眼有加*妙法拂尘|大理|阿紫|青眼有加*佛跳墙|大理|木婉清|随侯获珠*妙法拂尘|大理|阿紫|随侯获珠*佛跳墙|大理|刀白凤|东山高卧*竹蜻蜓|大理|刀白凤|东山高卧*金丝冠|苏州|白世镜*冰蚕语寒|妙法拂尘|苏州|白世镜|冰蚕语寒*猴儿酿|大理|风波恶|盔甲护心*宝斋刻刀|大理|风波恶|盔甲护心*金丝冠|苏州|龚冶乾|裹步不前*宝斋刻刀|苏州|龚冶乾|裹步不前*佛跳墙|苏州|朱丹臣|黄金铸台*竹蜻蜓|苏州|朱丹臣|黄金铸台*金丝冠|苏州|游坦之|火鼠言热*妙法佛尘|苏州|游坦之|火鼠言热*佛跳墙|大理|全冠清|安禅破毒*竹蜻蜓|大理|全冠清|安禅破毒*佛跳墙|大理|钟灵|步袜生尘*竹蜻蜓|大理|钟灵|步袜生尘*竹蜻蜓|苏州|邓百川|冰雪交加*妙法拂尘|苏州|邓百川|冰雪交加*天青汝窑瓷|洛阳|夜来|刺血书经*宝斋刻刀|洛阳|夜来|刺血书经*天青汝窑瓷|洛阳|傅远志|直捣黄龙*菩提木佛珠|洛阳|傅远志|直捣黄龙*宝斋刻|苏州|无执|临渊覆冰*焦尾琴|苏州|无执|临渊覆冰*多宝塔碑帖|大理|崔璎|临渊覆冰*宝斋刻刀|大理|崔璎|临渊覆冰*宝斋刻刀|大理|段正淳|羿妻窃药*太湖银鱼|大理|段正淳|羿妻窃药*妙法佛尘|洛阳|苏延清|昭君落雁*青瓷梅子盏|洛阳|苏延清|昭君落雁*竹雅香炉|洛阳|叶二娘|药石之力*青瓷梅子盏|洛阳|叶二娘|药石之力*宝斋刻刀|苏州|唐简|反戈一击*竹雅香炉|苏州|唐简|反戈一击*朱砂印泥|洛阳|无崖子|鼎湖龙吟*菩提木佛珠|洛阳|无崖子|鼎湖龙吟*徐夫人匕|大理|梦姑|春风江南*太湖银鱼|大理|梦姑|春风江南*女儿红|洛阳|乔峰|大江之势*剑谱|洛阳|乔峰|大江之势*桃花泉奕谱|洛阳|段誉|越王破吴*多宝塔碑帖|洛阳|段誉|越王破吴*义山诗集|洛阳|虚竹|诛清君侧*大红袍|洛阳|虚竹|诛清君侧*琴箫剑谱|洛阳|慕容复|百二秦关*青玉佩|洛阳|慕容复|百二秦关*满日弓|苏州|李秋水|避守孤城*玄铁矿石|苏州|李秋水|避守孤城*胭脂盒|苏州|王语嫣|汴和抱玉*焦尾琴|苏州|王语嫣|汴和抱玉*湖州笔|大理|阿朱|桃源避难*三段锦紫牙|大理|阿朱|桃源避难*澄心纸|洛阳|天山童姥|攻守兼备*酸角糕|洛阳|天山童姥|攻守兼备"
    elseif tem == "火" then
        return "十样花罗|苏州|云中鹤|烈火灼心*竹蜻蜓 |苏州|云中鹤|烈火灼心*大红袍|大理|原微之|四面楚歌*宝斋刻刀|大理|原微之|四面楚歌*十样花罗|洛阳|燕驰野|重耳纵火|妙法佛尘|洛阳|燕驰野|重耳纵火*上等马驹|苏州|朝覆雨|三尺冰冻*山水图|苏州|慕容信|铁锁横江*冰素针|苏州|段延庆|妇人之毒*猴儿酿|苏州|谭公|魏武持刀*金丝冠|苏州|谭公|魏武持刀*猴儿酿|苏州|谭婆|三刀一梦*佛跳墙|苏州|谭婆|三刀一梦*金丝冠|苏州|赵钱孙|龟鹤延年*猴儿酿|苏州|赵钱孙|龟鹤延年*金丝冠|大理|黎夫人|兵甲护塞*猴儿酿|大理|黎夫人|兵甲护塞*猴儿酿|大理|桑土公|飞燕轻姿*金丝冠|大理|桑土公|飞燕轻姿*猴儿酿|大理|卓不凡|周王一怒*金丝冠|大理|卓不凡|周王一怒*猴儿酿|大理|芙蓉仙子|投壶问月*金丝冠|大理|芙蓉仙子|投壶问月*宝斋刻刀|大理|包不同|龟寿千年*佛跳墙|大理|包不同|龟寿千年*佛跳墙|大理|阿紫|青眼有加*妙法拂尘|大理|阿紫|青眼有加*佛跳墙|大理|木婉清|随侯获珠*妙法拂尘|大理|阿紫|随侯获珠*佛跳墙|大理|刀白凤|东山高卧*竹蜻蜓|大理|刀白凤|东山高卧*金丝冠|苏州|白世镜*冰蚕语寒|妙法拂尘|苏州|白世镜|冰蚕语寒*猴儿酿|大理|风波恶|盔甲护心*宝斋刻刀|大理|风波恶|盔甲护心*金丝冠|苏州|龚冶乾|裹步不前*宝斋刻刀|苏州|龚冶乾|裹步不前*佛跳墙|苏州|朱丹臣|黄金铸台*竹蜻蜓|苏州|朱丹臣|黄金铸台*金丝冠|苏州|游坦之|火鼠言热*妙法佛尘|苏州|游坦之|火鼠言热*佛跳墙|大理|全冠清|安禅破毒*竹蜻蜓|大理|全冠清|安禅破毒*佛跳墙|大理|钟灵|步袜生尘*竹蜻蜓|大理|钟灵|步袜生尘*竹蜻蜓|苏州|邓百川|冰雪交加*妙法拂尘|苏州|邓百川|冰雪交加*天青汝窑瓷|洛阳|夜来|刺血书经*宝斋刻刀|洛阳|夜来|刺血书经*天青汝窑瓷|洛阳|傅远志|直捣黄龙*菩提木佛珠|洛阳|傅远志|直捣黄龙*宝斋刻|苏州|无执|临渊覆冰*焦尾琴|苏州|无执|临渊覆冰*多宝塔碑帖|大理|崔璎|临渊覆冰*宝斋刻刀|大理|崔璎|临渊覆冰*宝斋刻刀|大理|段正淳|羿妻窃药*太湖银鱼|大理|段正淳|羿妻窃药*妙法佛尘|洛阳|苏延清|昭君落雁*青瓷梅子盏|洛阳|苏延清|昭君落雁*竹雅香炉|洛阳|叶二娘|药石之力*青瓷梅子盏|洛阳|叶二娘|药石之力*宝斋刻刀|苏州|唐简|反戈一击*竹雅香炉|苏州|唐简|反戈一击*朱砂印泥|洛阳|无崖子|鼎湖龙吟*菩提木佛珠|洛阳|无崖子|鼎湖龙吟*徐夫人匕|大理|梦姑|春风江南*太湖银鱼|大理|梦姑|春风江南*女儿红|洛阳|乔峰|大江之势*剑谱|洛阳|乔峰|大江之势*桃花泉奕谱|洛阳|段誉|越王破吴*多宝塔碑帖|洛阳|段誉|越王破吴*义山诗集|洛阳|虚竹|诛清君侧*大红袍|洛阳|虚竹|诛清君侧*琴箫剑谱|洛阳|慕容复|百二秦关*青玉佩|洛阳|慕容复|百二秦关*满日弓|苏州|李秋水|避守孤城*玄铁矿石|苏州|李秋水|避守孤城*胭脂盒|苏州|王语嫣|汴和抱玉*焦尾琴|苏州|王语嫣|汴和抱玉*湖州笔|大理|阿朱|桃源避难*三段锦紫牙|大理|阿朱|桃源避难*澄心纸|洛阳|天山童姥|攻守兼备*酸角糕|洛阳|天山童姥|攻守兼备"
    elseif tem == "玄" then
        return "山水图|苏州|慕容信|铁锁横江*竹蜻蜓|苏州|慕容信|铁锁横江*大红袍|大理|原微之|四面楚歌*宝斋刻刀|大理|原微之|四面楚歌*妙法佛尘|洛阳|段思安|图穷匕现*山水图|洛阳|段思安|图穷匕现*上等马驹|苏州|朝覆雨|三尺冰冻*十样花罗|苏州|云中鹤|烈火灼心*冰素针|苏州|段延庆|妇人之毒*猴儿酿|苏州|谭公|魏武持刀*金丝冠|苏州|谭公|魏武持刀*猴儿酿|苏州|谭婆|三刀一梦*佛跳墙|苏州|谭婆|三刀一梦*金丝冠|苏州|赵钱孙|龟鹤延年*猴儿酿|苏州|赵钱孙|龟鹤延年*金丝冠|大理|黎夫人|兵甲护塞*猴儿酿|大理|黎夫人|兵甲护塞*猴儿酿|大理|桑土公|飞燕轻姿*金丝冠|大理|桑土公|飞燕轻姿*猴儿酿|大理|卓不凡|周王一怒*金丝冠|大理|卓不凡|周王一怒*猴儿酿|大理|芙蓉仙子|投壶问月*金丝冠|大理|芙蓉仙子|投壶问月*宝斋刻刀|大理|包不同|龟寿千年*佛跳墙|大理|包不同|龟寿千年*佛跳墙|大理|阿紫|青眼有加*妙法拂尘|大理|阿紫|青眼有加*佛跳墙|大理|木婉清|随侯获珠*妙法拂尘|大理|阿紫|随侯获珠*佛跳墙|大理|刀白凤|东山高卧*竹蜻蜓|大理|刀白凤|东山高卧*金丝冠|苏州|白世镜*冰蚕语寒|妙法拂尘|苏州|白世镜|冰蚕语寒*猴儿酿|大理|风波恶|盔甲护心*宝斋刻刀|大理|风波恶|盔甲护心*金丝冠|苏州|龚冶乾|裹步不前*宝斋刻刀|苏州|龚冶乾|裹步不前*佛跳墙|苏州|朱丹臣|黄金铸台*竹蜻蜓|苏州|朱丹臣|黄金铸台*金丝冠|苏州|游坦之|火鼠言热*妙法佛尘|苏州|游坦之|火鼠言热*佛跳墙|大理|全冠清|安禅破毒*竹蜻蜓|大理|全冠清|安禅破毒*佛跳墙|大理|钟灵|步袜生尘*竹蜻蜓|大理|钟灵|步袜生尘*竹蜻蜓|苏州|邓百川|冰雪交加*妙法拂尘|苏州|邓百川|冰雪交加*天青汝窑瓷|洛阳|夜来|刺血书经*宝斋刻刀|洛阳|夜来|刺血书经*天青汝窑瓷|洛阳|傅远志|直捣黄龙*菩提木佛珠|洛阳|傅远志|直捣黄龙*宝斋刻|苏州|无执|临渊覆冰*焦尾琴|苏州|无执|临渊覆冰*多宝塔碑帖|大理|崔璎|临渊覆冰*宝斋刻刀|大理|崔璎|临渊覆冰*宝斋刻刀|大理|段正淳|羿妻窃药*太湖银鱼|大理|段正淳|羿妻窃药*妙法佛尘|洛阳|苏延清|昭君落雁*青瓷梅子盏|洛阳|苏延清|昭君落雁*竹雅香炉|洛阳|叶二娘|药石之力*青瓷梅子盏|洛阳|叶二娘|药石之力*宝斋刻刀|苏州|唐简|反戈一击*竹雅香炉|苏州|唐简|反戈一击*朱砂印泥|洛阳|无崖子|鼎湖龙吟*菩提木佛珠|洛阳|无崖子|鼎湖龙吟*徐夫人匕|大理|梦姑|春风江南*太湖银鱼|大理|梦姑|春风江南*女儿红|洛阳|乔峰|大江之势*剑谱|洛阳|乔峰|大江之势*桃花泉奕谱|洛阳|段誉|越王破吴*多宝塔碑帖|洛阳|段誉|越王破吴*义山诗集|洛阳|虚竹|诛清君侧*大红袍|洛阳|虚竹|诛清君侧*琴箫剑谱|洛阳|慕容复|百二秦关*青玉佩|洛阳|慕容复|百二秦关*满日弓|苏州|李秋水|避守孤城*玄铁矿石|苏州|李秋水|避守孤城*胭脂盒|苏州|王语嫣|汴和抱玉*焦尾琴|苏州|王语嫣|汴和抱玉*湖州笔|大理|阿朱|桃源避难*三段锦紫牙|大理|阿朱|桃源避难*澄心纸|洛阳|天山童姥|攻守兼备*酸角糕|洛阳|天山童姥|攻守兼备"
    elseif tem == "毒" then
        return "竹蜻蜓|苏州|段延庆|妇人之毒*冰素针|苏州|段延庆|妇人之毒*大红袍|大理|原微之|四面楚歌*宝斋刻刀|大理|原微之|四面楚歌*妙法佛尘|洛阳|解宜|图穷匕现*冰素针|洛阳|解宜|图穷匕现*上等马驹|苏州|朝覆雨|三尺冰冻*十样花罗|苏州|云中鹤|烈火灼心*山水图|苏州|慕容信|铁锁横江*猴儿酿|苏州|谭公|魏武持刀*金丝冠|苏州|谭公|魏武持刀*猴儿酿|苏州|谭婆|三刀一梦*佛跳墙|苏州|谭婆|三刀一梦*金丝冠|苏州|赵钱孙|龟鹤延年*猴儿酿|苏州|赵钱孙|龟鹤延年*金丝冠|大理|黎夫人|兵甲护塞*猴儿酿|大理|黎夫人|兵甲护塞*猴儿酿|大理|桑土公|飞燕轻姿*金丝冠|大理|桑土公|飞燕轻姿*猴儿酿|大理|卓不凡|周王一怒*金丝冠|大理|卓不凡|周王一怒*猴儿酿|大理|芙蓉仙子|投壶问月*金丝冠|大理|芙蓉仙子|投壶问月*宝斋刻刀|大理|包不同|龟寿千年*佛跳墙|大理|包不同|龟寿千年*佛跳墙|大理|阿紫|青眼有加*妙法拂尘|大理|阿紫|青眼有加*佛跳墙|大理|木婉清|随侯获珠*妙法拂尘|大理|阿紫|随侯获珠*佛跳墙|大理|刀白凤|东山高卧*竹蜻蜓|大理|刀白凤|东山高卧*金丝冠|苏州|白世镜*冰蚕语寒|妙法拂尘|苏州|白世镜|冰蚕语寒*猴儿酿|大理|风波恶|盔甲护心*宝斋刻刀|大理|风波恶|盔甲护心*金丝冠|苏州|龚冶乾|裹步不前*宝斋刻刀|苏州|龚冶乾|裹步不前*佛跳墙|苏州|朱丹臣|黄金铸台*竹蜻蜓|苏州|朱丹臣|黄金铸台*金丝冠|苏州|游坦之|火鼠言热*妙法佛尘|苏州|游坦之|火鼠言热*佛跳墙|大理|全冠清|安禅破毒*竹蜻蜓|大理|全冠清|安禅破毒*佛跳墙|大理|钟灵|步袜生尘*竹蜻蜓|大理|钟灵|步袜生尘*竹蜻蜓|苏州|邓百川|冰雪交加*妙法拂尘|苏州|邓百川|冰雪交加*天青汝窑瓷|洛阳|夜来|刺血书经*宝斋刻刀|洛阳|夜来|刺血书经*天青汝窑瓷|洛阳|傅远志|直捣黄龙*菩提木佛珠|洛阳|傅远志|直捣黄龙*宝斋刻|苏州|无执|临渊覆冰*焦尾琴|苏州|无执|临渊覆冰*多宝塔碑帖|大理|崔璎|临渊覆冰*宝斋刻刀|大理|崔璎|临渊覆冰*宝斋刻刀|大理|段正淳|羿妻窃药*太湖银鱼|大理|段正淳|羿妻窃药*妙法佛尘|洛阳|苏延清|昭君落雁*青瓷梅子盏|洛阳|苏延清|昭君落雁*竹雅香炉|洛阳|叶二娘|药石之力*青瓷梅子盏|洛阳|叶二娘|药石之力*宝斋刻刀|苏州|唐简|反戈一击*竹雅香炉|苏州|唐简|反戈一击*朱砂印泥|洛阳|无崖子|鼎湖龙吟*菩提木佛珠|洛阳|无崖子|鼎湖龙吟*徐夫人匕|大理|梦姑|春风江南*太湖银鱼|大理|梦姑|春风江南*女儿红|洛阳|乔峰|大江之势*剑谱|洛阳|乔峰|大江之势*桃花泉奕谱|洛阳|段誉|越王破吴*多宝塔碑帖|洛阳|段誉|越王破吴*义山诗集|洛阳|虚竹|诛清君侧*大红袍|洛阳|虚竹|诛清君侧*琴箫剑谱|洛阳|慕容复|百二秦关*青玉佩|洛阳|慕容复|百二秦关*满日弓|苏州|李秋水|避守孤城*玄铁矿石|苏州|李秋水|避守孤城*胭脂盒|苏州|王语嫣|汴和抱玉*焦尾琴|苏州|王语嫣|汴和抱玉*湖州笔|大理|阿朱|桃源避难*三段锦紫牙|大理|阿朱|桃源避难*澄心纸|洛阳|天山童姥|攻守兼备*酸角糕|洛阳|天山童姥|攻守兼备"
    else
        return "上等马驹|苏州|朝覆雨|三尺冰冻*十样花罗|苏州|云中鹤|烈火灼心*山水图|苏州|慕容信|铁锁横江*冰素针|苏州|段延庆|妇人之毒*猴儿酿|苏州|谭公|魏武持刀*金丝冠|苏州|谭公|魏武持刀*猴儿酿|苏州|谭婆|三刀一梦*佛跳墙|苏州|谭婆|三刀一梦*金丝冠|苏州|赵钱孙|龟鹤延年*猴儿酿|苏州|赵钱孙|龟鹤延年*金丝冠|大理|黎夫人|兵甲护塞*猴儿酿|大理|黎夫人|兵甲护塞*猴儿酿|大理|桑土公|飞燕轻姿*金丝冠|大理|桑土公|飞燕轻姿*猴儿酿|大理|卓不凡|周王一怒*金丝冠|大理|卓不凡|周王一怒*猴儿酿|大理|芙蓉仙子|投壶问月*金丝冠|大理|芙蓉仙子|投壶问月*宝斋刻刀|大理|包不同|龟寿千年*佛跳墙|大理|包不同|龟寿千年*佛跳墙|大理|阿紫|青眼有加*妙法拂尘|大理|阿紫|青眼有加*佛跳墙|大理|木婉清|随侯获珠*妙法拂尘|大理|阿紫|随侯获珠*佛跳墙|大理|刀白凤|东山高卧*竹蜻蜓|大理|刀白凤|东山高卧*金丝冠|苏州|白世镜*冰蚕语寒|妙法拂尘|苏州|白世镜|冰蚕语寒*猴儿酿|大理|风波恶|盔甲护心*宝斋刻刀|大理|风波恶|盔甲护心*金丝冠|苏州|龚冶乾|裹步不前*宝斋刻刀|苏州|龚冶乾|裹步不前*佛跳墙|苏州|朱丹臣|黄金铸台*竹蜻蜓|苏州|朱丹臣|黄金铸台*金丝冠|苏州|游坦之|火鼠言热*妙法佛尘|苏州|游坦之|火鼠言热*佛跳墙|大理|全冠清|安禅破毒*竹蜻蜓|大理|全冠清|安禅破毒*佛跳墙|大理|钟灵|步袜生尘*竹蜻蜓|大理|钟灵|步袜生尘*竹蜻蜓|苏州|邓百川|冰雪交加*妙法拂尘|苏州|邓百川|冰雪交加*天青汝窑瓷|洛阳|夜来|刺血书经*宝斋刻刀|洛阳|夜来|刺血书经*天青汝窑瓷|洛阳|傅远志|直捣黄龙*菩提木佛珠|洛阳|傅远志|直捣黄龙*宝斋刻|苏州|无执|临渊覆冰*焦尾琴|苏州|无执|临渊覆冰*多宝塔碑帖|大理|崔璎|临渊覆冰*宝斋刻刀|大理|崔璎|临渊覆冰*宝斋刻刀|大理|段正淳|羿妻窃药*太湖银鱼|大理|段正淳|羿妻窃药*妙法佛尘|洛阳|苏延清|昭君落雁*青瓷梅子盏|洛阳|苏延清|昭君落雁*竹雅香炉|洛阳|叶二娘|药石之力*青瓷梅子盏|洛阳|叶二娘|药石之力*宝斋刻刀|苏州|唐简|反戈一击*竹雅香炉|苏州|唐简|反戈一击*朱砂印泥|洛阳|无崖子|鼎湖龙吟*菩提木佛珠|洛阳|无崖子|鼎湖龙吟*徐夫人匕|大理|梦姑|春风江南*太湖银鱼|大理|梦姑|春风江南*女儿红|洛阳|乔峰|大江之势*剑谱|洛阳|乔峰|大江之势*桃花泉奕谱|洛阳|段誉|越王破吴*多宝塔碑帖|洛阳|段誉|越王破吴*义山诗集|洛阳|虚竹|诛清君侧*大红袍|洛阳|虚竹|诛清君侧*琴箫剑谱|洛阳|慕容复|百二秦关*青玉佩|洛阳|慕容复|百二秦关*满日弓|苏州|李秋水|避守孤城*玄铁矿石|苏州|李秋水|避守孤城*胭脂盒|苏州|王语嫣|汴和抱玉*焦尾琴|苏州|王语嫣|汴和抱玉*湖州笔|大理|阿朱|桃源避难*三段锦紫牙|大理|阿朱|桃源避难*澄心纸|洛阳|天山童姥|攻守兼备*酸角糕|洛阳|天山童姥|攻守兼备"
    end

end

xrpz("名士赠礼", "礼扎名称", "良品礼扎|名士还礼·良品|精品礼扎|名士还礼·精品|珍品礼扎|名士还礼·珍品|神品礼扎|名士还礼·神品")
xrpz("名士赠礼", "赠礼信息", xrzsxx())
xrpz("名士赠礼", "礼券兑换", "神品礼物兑换券|朱砂印泥|10000")

if 主属性 == "冰" then
    xrpz("名士赠礼", "礼扎名称", "良品礼扎|名士还礼·良品|精品礼扎|名士还礼·精品|珍品礼扎|名士还礼·珍品|神品礼扎|名士还礼·神品")
    xrpz("名士赠礼", "赠礼信息", xrzsxx())
    xrpz("名士赠礼", "礼券兑换", 冰属性换礼列表)
elseif 主属性 == "火" then
    xrpz("名士赠礼", "礼扎名称", "良品礼扎|名士还礼·良品|精品礼扎|名士还礼·精品|珍品礼扎|名士还礼·珍品|神品礼扎|名士还礼·神品")
    xrpz("名士赠礼", "赠礼信息", xrzsxx())
    xrpz("名士赠礼", "礼券兑换", 火属性换礼列表)
elseif 主属性 == "玄" then
    xrpz("名士赠礼", "礼扎名称", "良品礼扎|名士还礼·良品|精品礼扎|名士还礼·精品|珍品礼扎|名士还礼·珍品|神品礼扎|名士还礼·神品")
    xrpz("名士赠礼", "赠礼信息", xrzsxx())
    xrpz("名士赠礼", "礼券兑换", 玄属性换礼列表)
elseif 主属性 == "毒" then
    xrpz("名士赠礼", "礼扎名称", "良品礼扎|名士还礼·良品|精品礼扎|名士还礼·精品|珍品礼扎|名士还礼·珍品|神品礼扎|名士还礼·神品")
    xrpz("名士赠礼", "赠礼信息", xrzsxx())
    xrpz("名士赠礼", "礼券兑换", 毒属性换礼列表)
end

--启动

if 开启兑换礼物 == 1 then
    取出物品("良品礼物兑换券|精品礼物兑换券|珍品礼物兑换券|神品礼物兑换券")
    延时(500)
    执行功能("名士礼物兑换")
    延时(500)
end
for i = 1, 3 do
    屏幕提示("共启动3次，这是开启第" .. i .. "次赠送礼物")
    延时(500)
    执行功能("名士赠礼")
    延时(500)
end
